//
// Created by ThinkPad on 2021-05-20.
//2. 下表为广州市最近两年（2014年8月份 ~ 2016年8月份）的 PM2.5 检测数据表，请按要求编程。
//要求A：编写一个程序，用户输入待查询年月份（输入格式：2015-03），输出该月份的 PM2.5 值。
#include<stdio.h>

int main()
{
    float pm25[3][12] = {
            {0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 31.3, 35.5, 58.7, 49.6, 55.5},
            {59.8, 54.9, 33.1, 38.2, 26.6, 20.5, 27.8, 38.5, 41.5, 44.7, 38.1, 41.5},
            {34.9, 36.4, 47.5, 37.9, 30.6, 23.4, 26.6, 34.3, 0.0, 0.0, 0.0, 0.0}
    };

    int year, month;

    scanf("%d-%d", &year, &month);
    year -= 2014;
    month -= 1;
    if(year >= 0 && year <= 2 && 0 <= month && month <= 11){

        if(pm25[year][month]){

            printf("%d年%d月广州的PM2.5值是: %.2f\n", year + 2014, month + 1, pm25[year][month]);
        }

    }else{

        printf("抱歉，该月份未收录数据！\n");
    }
    return 0;
}
