//
// Created by ThinkPad on 2021-06-10.

//以下程序输出结果?
/*#include <stdio.h>
int main()
{
*//*    -1
    10000000 00000000 00000000 00000001 原码
    11111111 11111111 11111111 11111110 反码
    11111111 11111111 11111111 11111111 反码*//*

    char a = -1;
    //11111111
    signed char b = -1;
    //11111111
    unsigned char c = -1;
    //11111111
    printf("a = %d, b = %d, c = %c", a, b, c);
    //整型提升  c= 00000000 00000000 00000000 11111111

    return 0;
}*/


////以下程序输出结果?
/*#include <stdio.h>
int main()
{
    char a = -128;
    //11111111111111111111111110000000
    //char a 10000000
    printf("%u\n",a);
    //整形提升高位补1   a = 11111111111111111111111110000000
    return 0;
}*/
//****************************************************************
/*
#include <stdio.h>
int main()
{
    char a = 128;//(127+1 = -128)
    //0000000 0000000 00000000 10000000
    //char a 10000000
    printf("%u\n",a);
//整形提升高位补1   a = 111111111111111111111111100000000
    return 0;
}*/
 //********************************************************************
/*#include <stdio.h>
int main()
{
    int a = -20;
    unsigned int b = 10;
    printf("%d\n",a + b);//-10
    //补码相加然后格式化输出
    return 0;
}*/
//****************************************************************************
#include <stdio.h>
int main()
{
    unsigned int i;
    for (i = 9; i >= 0; i--) {
        printf("%u\n",i);
//-1 作为无符号整数就是特别大的整数
    }
    return 0;
}
